ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
/**
 * \brief Component description for PIC32CX/0525SG12 ESPI_MEMORY
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_ESPI_MEMORY_COMPONENT_H_
#define _PIC32CX_0525SG12_ESPI_MEMORY_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_ESPI_MEMORY The eSPI Memory Component is one of two Logical Devices (along with the I/O Component) that provide access to all the\n    registers in the device.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ESPI_MEMORY */
/* ========================================================================== */

/* -------- ESPI_MEMORY_MBX_MEM_BASE_ADDRESS : (ESPI_MEMORY Offset: 0x130) (R/W 32) Mailbox Memory Base Address -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_bits_t;
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_RESETVALUE (0x01U)                                       /**<  (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) Mailbox Memory Base Address  Reset Value */

#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK_Pos (0)                                            /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK_Msk (0xFFU << ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK(value) (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_MASK_Pos))
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_Msk  (0x00013FFFUL)                                 /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB : (ESPI_MEMORY Offset: 0x13a) (R/W 16) ACPI EC Channel 0 Memory BAR (LSB) -------- */

typedef union
{
  struct
  {
    uint16_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint16_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint16_t :2;                        /**< bit: 14..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_RESETVALUE (0x204U)                                      /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) ACPI EC Channel 0 Memory BAR (LSB)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK_Msk (0xFFU << ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_MASK_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_Msk (0x00003FFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB : (ESPI_MEMORY Offset: 0x13c) (R/W 16) ACPI EC Channel 0 Memory BAR (MSB) -------- */

typedef union
{
  struct
  {
    uint16_t VIRTUALIZED:1;             /**< bit:      0  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint16_t :15;                       /**< bit:  1..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB) ACPI EC Channel 0 Memory BAR (MSB)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS : (ESPI_MEMORY Offset: 0x144) (R/W 32) ACPI EC Channel 1 Memory BAR -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_bits_t;
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_RESETVALUE (0x307U)                                      /**<  (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) ACPI EC Channel 1 Memory BAR  Reset Value */

#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK_Msk (0xFFU << ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK(value) (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_MASK_Pos))
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_Msk (0x00013FFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB : (ESPI_MEMORY Offset: 0x14e) (R/W 16) ACPI EC Channel 2 Memory BAR (LSB) -------- */

typedef union
{
  struct
  {
    uint16_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint16_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint16_t :2;                        /**< bit: 14..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_bits_t;
