ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_RESETVALUE (0x407U)                                      /**<  (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) ACPI EC Channel 2 Memory BAR (LSB)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK_Msk (0xFFU << ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK_Pos)  /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK(value) (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK_Msk & ((value) << ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_MASK_Pos))
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_Msk (0x00003FFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB : (ESPI_MEMORY Offset: 0x150) (R/W 16) ACPI EC Channel 2 Memory BAR (MSB) -------- */

typedef union
{
  struct
  {
    uint16_t VIRTUALIZED:1;             /**< bit:      0  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint16_t :15;                       /**< bit:  1..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_bits_t;
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB) ACPI EC Channel 2 Memory BAR (MSB)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS : (ESPI_MEMORY Offset: 0x158) (R/W 32) ACPI EC Channel 3 Memory BAR -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_bits_t;
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_RESETVALUE (0x507U)                                      /**<  (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) ACPI EC Channel 3 Memory BAR  Reset Value */

#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK_Msk (0xFFU << ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK(value) (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_MASK_Pos))
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_Msk (0x00013FFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS : (ESPI_MEMORY Offset: 0x16c) (R/W 32) Embedded Memory Interface (EMI) 0 Memory Base Address -------- */

typedef union
{
  struct
  {
    uint32_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint32_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t VIRTUALIZED:1;             /**< bit:     16  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_bits_t;
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_RESETVALUE (0x100FU)                                     /**<  (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) Embedded Memory Interface (EMI) 0 Memory Base Address  Reset Value */

