ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK_Pos (0)                                            /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK_Msk (0xFFU << ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK_Pos)  /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK(value) (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK_Msk & ((value) << ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_MASK_Pos))
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_VIRTUALIZED_Pos (16)                                           /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_Msk (0x00013FFFUL)                                 /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) Register Mask  */

/* -------- ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB : (ESPI_MEMORY Offset: 0x176) (R/W 16) Embedded Memory Interface (EMI) 1 Memory Base Address (LSB) -------- */

typedef union
{
  struct
  {
    uint16_t MASK:8;                    /**< bit:   0..7  These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. */
    uint16_t LOGICAL_DEVICE_NUMBER:6;   /**< bit:  8..13  These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. */
    uint16_t :2;                        /**< bit: 14..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_bits_t;
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_RESETVALUE (0x110FU)                                     /**<  (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) Embedded Memory Interface (EMI) 1 Memory Base Address (LSB)  Reset Value */

#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK_Pos (0)                                            /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Position */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK_Msk (0xFFU << ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK_Pos)  /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) These 8 bits are used to mask off address bits in the address match between an eSPI I/O address and the Host Address field of the BARs.\n      A block of up to 256 8-bit registers can be assigned to one base address. Mask */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK(value) (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK_Msk & ((value) << ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_MASK_Pos))
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos (8)                                            /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Position */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk (0x3FU << ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos)  /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) These 6 bits are used to specify a logical device number within a bus. This field is multiplied by 400h to provide the address within the\n      peripheral bus address. Logical Device Numbers that do not corresponding to logical devices that are present on the device are invalid. Mask */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER(value) (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Msk & ((value) << ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_LOGICAL_DEVICE_NUMBER_Pos))
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_Msk (0x00003FFFUL)                                 /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) Register Mask  */

/* -------- ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB : (ESPI_MEMORY Offset: 0x178) (R/W 16) Embedded Memory Interface (EMI) 1 Memory Base Address (MSB) -------- */

typedef union
{
  struct
  {
    uint16_t VIRTUALIZED:1;             /**< bit:      0  1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. */
    uint16_t :15;                       /**< bit:  1..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_bits_t;
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB) Embedded Memory Interface (EMI) 1 Memory Base Address (MSB)  Reset Value */

#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos (0)                                            /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Position */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Msk (0x1U << ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_VIRTUALIZED_Pos)  /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB) 1=Peripheral Channel I/O for this device is virtualized, and reads and writes are handled in firmware\n      0=All Peripheral Channel I/O Reads and Writes for this device are completed by hardware. Mask */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF : (ESPI_MEMORY Offset: 0x1ac) (R/W 16) SRAM 0 Memory Base Address Config -------- */

typedef union
{
  struct
  {
    uint16_t RAM_VALID:1;               /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint16_t RAM_ACCESS:2;              /**< bit:   1..2  These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region */
    uint16_t :1;                        /**< bit:      3  Reserved                                      */
    uint16_t RAM_SIZE:4;                /**< bit:   4..7  This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. */
    uint16_t :8;                        /**< bit:  8..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_bits_t;
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) SRAM 0 Memory Base Address Config  Reset Value */

#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_VALID_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_VALID_Msk (0x1U << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_VALID_Pos)  /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos (1)                                            /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region Position */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Msk (0x3U << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos)  /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region Mask */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS(value) (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Msk & ((value) << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos))
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos (4)                                            /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. Position */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Msk (0xFU << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos)  /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. Mask */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE(value) (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Msk & ((value) << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos))
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_Msk (0x000000F7UL)                                 /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB : (ESPI_MEMORY Offset: 0x1ae) (R/W 16) SRAM 0 Memory Base Address LSB -------- */

typedef union
{
  struct
  {
    uint16_t RAM_ADDRESS:16;            /**< bit:  0..15  This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_bits_t;
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB) SRAM 0 Memory Base Address LSB  Reset Value */

#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB) This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Position */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Msk (0xFFFFU << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos)  /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB) This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Mask */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS(value) (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Msk & ((value) << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos))
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB : (ESPI_MEMORY Offset: 0x1b0) (R/W 32) SRAM 0 Memory Base Address MSB -------- */

typedef union
{
  struct
  {
    uint32_t RAM_ADDRESS:16;            /**< bit:  0..15  This is the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_bits_t;
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB) SRAM 0 Memory Base Address MSB  Reset Value */

#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB) This is the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Position */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Msk (0xFFFFU << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos)  /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB) This is the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Mask */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS(value) (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Msk & ((value) << ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos))
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF : (ESPI_MEMORY Offset: 0x1b6) (R/W 16) SRAM 1 Memory Base Address Config -------- */

typedef union
{
  struct
  {
    uint16_t RAM_VALID:1;               /**< bit:      0  1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. */
    uint16_t RAM_ACCESS:2;              /**< bit:   1..2  These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region */
    uint16_t :1;                        /**< bit:      3  Reserved                                      */
    uint16_t RAM_SIZE:4;                /**< bit:   4..7  This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. */
    uint16_t :8;                        /**< bit:  8..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) SRAM 1 Memory Base Address Config  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_VALID_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_VALID_Msk (0x1U << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_VALID_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) 1=The BAR is valid and will participate in eSPI matches.\n      0=The BAR is ignored. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos (1)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region Position */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Msk (0x3U << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) These 2 bits define the access type of access to this SRAM region.\n      3=Host has Read/write access to the region\n      2=Host has Write-only access to the region\n      1=Host has Read-only access to the region\n      0=Host has no access to this region Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS(value) (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_ACCESS_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos (4)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Msk (0xFU << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) This field defines the size of the region mapped from Host Memory address space into the internal address space, in powers of 2.\n      15=The region is 64KB in extent\n      14=The region is 32KB in extent\n      ...\n      1=The region is 2B in extent\n      0=The region is 1B in extent. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE(value) (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_RAM_SIZE_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_Msk (0x000000F7UL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB : (ESPI_MEMORY Offset: 0x1b8) (R/W 16) SRAM 1 Memory Base Address LSB -------- */

typedef union
{
  struct
  {
    uint16_t RAM_ADDRESS:16;            /**< bit:  0..15  This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB) SRAM 1 Memory Base Address LSB  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB) This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB) This is the LSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS(value) (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_RAM_ADDRESS_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB : (ESPI_MEMORY Offset: 0x1ba) (R/W 16) SRAM 1 Memory Base Address MSB -------- */

typedef union
{
  struct
  {
    uint16_t RAM_ADDRESS:16;            /**< bit:  0..15  This the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB) SRAM 1 Memory Base Address MSB  Reset Value */

