ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB) This the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB) This the MSB of the 32-bit field that defines the base address of the internal memory region to which Host accesses\n      to the region starting at RAM eSPI Host Address are mapped. The least significant 2**RAM SIZE bits are ignored. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS(value) (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_RAM_ADDRESS_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_STATUS : (ESPI_MEMORY Offset: 0x200) (R/W 32) Bus Master Status Register -------- */

typedef union
{
  struct
  {
    uint32_t BM1_TRANSFER_DONE:1;       /**< bit:      0  This bit is set to '1' when a START transfer on Bus Master Channel 1 has completed, and occurs simultaneously with\n      the clearing of the BM1_BUSY bit. This may happen normally, but it is also guaranteed to happen if any of the Error bits in this\n      register section (bits[11:2]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed\n      to be in their final states, and can be examined. Firmware is required to clear this bit, by writing '1' to this bit position, before\n      altering any BM1 registers or making a new START request, otherwise interrupts from this block will be unreliable. (R/WC) */
    uint32_t BM1_BUSY:1;                /**< bit:      1  Hardware sets this bit to 1 when the control bit BM1_START in the Bus Master 1 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[11:2]) is set by an error condition. */
    uint32_t BM1_ABORTED_BY_EC:1;       /**< bit:      2  This bit is set when the control bit BM1_ABORT in the Bus Master 1 Control Register is written with a 1 during an active\n      transfer. (R/WC) */
    uint32_t BM1_ABORTED_BY_HOST:1;     /**< bit:      3  A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been\n      disabled by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the\n      Peripheral Channel Enable bit is '0'. (R/WC) */
    uint32_t BM1_ABORTED_BY_CH2_ERROR:1;  /**< bit:      4  This bit is set if an error occurs on Bus Master Channel 2 while a Channel 1 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM1_WAIT_BM2_NOT_BUSY in register Bus Master 1 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM1_TRANSFER_DONE bit is set. (R/WC) */
    uint32_t BM1_START_OVERFLOW:1;      /**< bit:      5  This bit is set if the bit BM1_START in the Bus Master 1 Control Register is written with a 1 while the bit BM1_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM1_TRANSFER_DONE=1). (R/WC) */
    uint32_t BM1_DATA_OVERRUN:1;        /**< bit:      6  This bit is set if the transfer on Bus Master Channel 1 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) */
    uint32_t BM1_INCOMPLETE:1;          /**< bit:      7  This bit is set if the transfer on Bus Master Channel 1 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) */
    uint32_t BM1_FAIL:1;                /**< bit:      8  This bit is set if a Layer 3 transaction from Bus Master Channel 1 completes with an Unsuccessful Completion packet from\n      the eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) */
    uint32_t BM1_INTERNAL_BUS_ERROR:1;  /**< bit:      9  This bit is set if a transfer on Bus Master Channel 1 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 1 internal Address register. (R/WC) */
    uint32_t :1;                        /**< bit:     10  Reserved                                      */
    uint32_t BM1_BAD_REQUEST:1;         /**< bit:     11  This bit is set, and the START request is terminated immediately (BM1_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM1_START bit is written to '1' by firmware.  (R/WC)\n      Examples of a Bad Request are:\n      Length of zero\n      Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather structure\n      of the Host memory, so is not allowed. */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t BM2_TRANSFER_DONE:1;       /**< bit:     16  This bit is set to '1' when a START transfer on Bus Master Channel 2 has completed, and occurs simultaneously with the\n      clearing of the BM2_BUSY bit. This may happen normally, but it is guaranteed to happen also if any of the Error bits in this register\n      section (bits[27:18]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed to be in their\n      final states, and can be examined. (R/WC) */
    uint32_t BM2_BUSY:1;                /**< bit:     17  Hardware sets this bit to 1 when the control bit BM2_START in the Bus Master 2 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[27:18]) is set by an error condition. */
    uint32_t BM2_ABORTED_BY_EC:1;       /**< bit:     18  This bit is set when the control bit BM2_ABORT in the Bus Master 2 Control Register is written with a 1 during an active transfer. (R/WC) */
    uint32_t BM2_ABORTED_BY_HOST:1;     /**< bit:     19  A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been disabled\n      by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral\n      Channel Enable bit is '0'. (R/WC) */
    uint32_t BM2_ABORTED_BY_CH1_ERROR:1;  /**< bit:     20  This bit is set if an error occurs on Bus Master Channel 1 while a Channel 2 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM2_WAIT_BM1_NOT_BUSY in register Bus Master 2 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM2_TRANSFER_DONE bit is set. (R/WC) */
    uint32_t BM2_START_OVERFLOW:1;      /**< bit:     21  This bit is set if the bit BM2_START in the Bus Master 2 Control Register is written with a 1 while the bit BM2_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM2_TRANSFER_DONE=1). (R/WC) */
    uint32_t BM2_DATA_OVERRUN:1;        /**< bit:     22  This bit is set if the transfer on Bus Master Channel 2 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) */
    uint32_t BM2_INCOMPLETE:1;          /**< bit:     23  This bit is set if the transfer on Bus Master Channel 2 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) */
    uint32_t BM2_FAIL:1;                /**< bit:     24  This bit is set if a Layer 3 transaction from Bus Master Channel 2 completes with an Unsuccessful Completion packet from the\n      eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) */
    uint32_t BM2_INTERNAL_BUS_ERROR:1;  /**< bit:     25  This bit is set if a transfer on Bus Master Channel 2 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 2 internal Address register. (R/WC) */
    uint32_t :1;                        /**< bit:     26  Reserved                                      */
    uint32_t BM2_BAD_REQUEST:1;         /**< bit:     27  This bit is set, and the START request is terminated immediately (BM2_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM2_START bit is written to '1' by firmware. (R/WC)\n      Examples of a Bad Request are:\n      Length of zero, or Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather\n      structure of the Host memory, so is not allowed. */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_STATUS_bits_t;
#define ESPI_MEMORY_BUS_MASTER_STATUS_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_STATUS) Bus Master Status Register  Reset Value */

