ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_TRANSFER_DONE_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set to '1' when a START transfer on Bus Master Channel 1 has completed, and occurs simultaneously with\n      the clearing of the BM1_BUSY bit. This may happen normally, but it is also guaranteed to happen if any of the Error bits in this\n      register section (bits[11:2]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed\n      to be in their final states, and can be examined. Firmware is required to clear this bit, by writing '1' to this bit position, before\n      altering any BM1 registers or making a new START request, otherwise interrupts from this block will be unreliable. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_TRANSFER_DONE_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_TRANSFER_DONE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set to '1' when a START transfer on Bus Master Channel 1 has completed, and occurs simultaneously with\n      the clearing of the BM1_BUSY bit. This may happen normally, but it is also guaranteed to happen if any of the Error bits in this\n      register section (bits[11:2]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed\n      to be in their final states, and can be examined. Firmware is required to clear this bit, by writing '1' to this bit position, before\n      altering any BM1 registers or making a new START request, otherwise interrupts from this block will be unreliable. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BUSY_Pos (1)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Hardware sets this bit to 1 when the control bit BM1_START in the Bus Master 1 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[11:2]) is set by an error condition. Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BUSY_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BUSY_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Hardware sets this bit to 1 when the control bit BM1_START in the Bus Master 1 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[11:2]) is set by an error condition. Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_EC_Pos (2)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set when the control bit BM1_ABORT in the Bus Master 1 Control Register is written with a 1 during an active\n      transfer. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_EC_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_EC_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set when the control bit BM1_ABORT in the Bus Master 1 Control Register is written with a 1 during an active\n      transfer. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_HOST_Pos (3)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been\n      disabled by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the\n      Peripheral Channel Enable bit is '0'. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_HOST_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_HOST_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been\n      disabled by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the\n      Peripheral Channel Enable bit is '0'. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_CH2_ERROR_Pos (4)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if an error occurs on Bus Master Channel 2 while a Channel 1 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM1_WAIT_BM2_NOT_BUSY in register Bus Master 1 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM1_TRANSFER_DONE bit is set. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_CH2_ERROR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_ABORTED_BY_CH2_ERROR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if an error occurs on Bus Master Channel 2 while a Channel 1 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM1_WAIT_BM2_NOT_BUSY in register Bus Master 1 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM1_TRANSFER_DONE bit is set. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_START_OVERFLOW_Pos (5)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the bit BM1_START in the Bus Master 1 Control Register is written with a 1 while the bit BM1_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM1_TRANSFER_DONE=1). (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_START_OVERFLOW_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_START_OVERFLOW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the bit BM1_START in the Bus Master 1 Control Register is written with a 1 while the bit BM1_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM1_TRANSFER_DONE=1). (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_DATA_OVERRUN_Pos (6)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 1 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_DATA_OVERRUN_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_DATA_OVERRUN_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 1 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INCOMPLETE_Pos (7)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 1 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INCOMPLETE_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INCOMPLETE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 1 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_FAIL_Pos (8)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a Layer 3 transaction from Bus Master Channel 1 completes with an Unsuccessful Completion packet from\n      the eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_FAIL_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_FAIL_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a Layer 3 transaction from Bus Master Channel 1 completes with an Unsuccessful Completion packet from\n      the eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INTERNAL_BUS_ERROR_Pos (9)                                            /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a transfer on Bus Master Channel 1 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 1 internal Address register. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INTERNAL_BUS_ERROR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_INTERNAL_BUS_ERROR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a transfer on Bus Master Channel 1 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 1 internal Address register. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BAD_REQUEST_Pos (11)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set, and the START request is terminated immediately (BM1_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM1_START bit is written to '1' by firmware.  (R/WC)\n      Examples of a Bad Request are:\n      Length of zero\n      Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather structure\n      of the Host memory, so is not allowed. Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BAD_REQUEST_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM1_BAD_REQUEST_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set, and the START request is terminated immediately (BM1_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM1_START bit is written to '1' by firmware.  (R/WC)\n      Examples of a Bad Request are:\n      Length of zero\n      Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather structure\n      of the Host memory, so is not allowed. Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_TRANSFER_DONE_Pos (16)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set to '1' when a START transfer on Bus Master Channel 2 has completed, and occurs simultaneously with the\n      clearing of the BM2_BUSY bit. This may happen normally, but it is guaranteed to happen also if any of the Error bits in this register\n      section (bits[27:18]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed to be in their\n      final states, and can be examined. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_TRANSFER_DONE_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_TRANSFER_DONE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set to '1' when a START transfer on Bus Master Channel 2 has completed, and occurs simultaneously with the\n      clearing of the BM2_BUSY bit. This may happen normally, but it is guaranteed to happen also if any of the Error bits in this register\n      section (bits[27:18]) is set by an error condition. At the time that this bit is set to '1', the Error bits are guaranteed to be in their\n      final states, and can be examined. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BUSY_Pos (17)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Hardware sets this bit to 1 when the control bit BM2_START in the Bus Master 2 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[27:18]) is set by an error condition. Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BUSY_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BUSY_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Hardware sets this bit to 1 when the control bit BM2_START in the Bus Master 2 Control Register is written with a 1.\n      This bit is cleared when the transfer completes. This may happen normally, but it is guaranteed to happen also if any of the Error bits\n      in this register section (bits[27:18]) is set by an error condition. Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_EC_Pos (18)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set when the control bit BM2_ABORT in the Bus Master 2 Control Register is written with a 1 during an active transfer. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_EC_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_EC_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set when the control bit BM2_ABORT in the Bus Master 2 Control Register is written with a 1 during an active transfer. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_HOST_Pos (19)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been disabled\n      by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral\n      Channel Enable bit is '0'. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_HOST_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_HOST_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) A '1' in this bit indicates that the last requested Mastering operation was aborted because Bus Mastering has been disabled\n      by the Host. Bus Mastering is disabled whenever the Peripheral Channel Mastering Enable bit in that register is '0', or the Peripheral\n      Channel Enable bit is '0'. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_CH1_ERROR_Pos (20)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if an error occurs on Bus Master Channel 1 while a Channel 2 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM2_WAIT_BM1_NOT_BUSY in register Bus Master 2 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM2_TRANSFER_DONE bit is set. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_CH1_ERROR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_ABORTED_BY_CH1_ERROR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if an error occurs on Bus Master Channel 1 while a Channel 2 transfer is in progress, if the two channels\n      are linked. Linkage occurs when bit BM2_WAIT_BM1_NOT_BUSY in register Bus Master 2 Control Register is set to '1'. No traffic will occur\n      from this channel before the error is posted and the BM2_TRANSFER_DONE bit is set. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_START_OVERFLOW_Pos (21)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the bit BM2_START in the Bus Master 2 Control Register is written with a 1 while the bit BM2_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM2_TRANSFER_DONE=1). (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_START_OVERFLOW_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_START_OVERFLOW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the bit BM2_START in the Bus Master 2 Control Register is written with a 1 while the bit BM2_BUSY is 1.\n      This condition immediately halts the transfer in progress also (BM2_TRANSFER_DONE=1). (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_DATA_OVERRUN_Pos (22)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 2 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_DATA_OVERRUN_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_DATA_OVERRUN_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 2 completed but too many bytes were delivered by the eSPI Host.\n      Some of the data will not be delivered on the internal bus. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INCOMPLETE_Pos (23)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 2 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INCOMPLETE_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INCOMPLETE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if the transfer on Bus Master Channel 2 completed but an insufficient number of bytes were transferred.\n      Some of the data will not be delivered on the internal bus. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_FAIL_Pos (24)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a Layer 3 transaction from Bus Master Channel 2 completes with an Unsuccessful Completion packet from the\n      eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_FAIL_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_FAIL_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a Layer 3 transaction from Bus Master Channel 2 completes with an Unsuccessful Completion packet from the\n      eSPI Host. For example, this will happen if the START request attempts to read from a forbidden or unmapped address in System Memory.\n      Bad Writes, however, cannot be flagged this way, and will be silently dropped by the eSPI Host without setting this bit. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INTERNAL_BUS_ERROR_Pos (25)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a transfer on Bus Master Channel 2 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 2 internal Address register. (R/WC) Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INTERNAL_BUS_ERROR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_INTERNAL_BUS_ERROR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set if a transfer on Bus Master Channel 2 is terminated due to a bus error internal to the EC. This can happen\n      if an invalid address is provided in the Bus Master 2 internal Address register. (R/WC) Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BAD_REQUEST_Pos (27)                                           /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set, and the START request is terminated immediately (BM2_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM2_START bit is written to '1' by firmware. (R/WC)\n      Examples of a Bad Request are:\n      Length of zero, or Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather\n      structure of the Host memory, so is not allowed. Position */
#define ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BAD_REQUEST_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_STATUS_BM2_BAD_REQUEST_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_STATUS) This bit is set, and the START request is terminated immediately (BM2_TRANSFER_DONE=1) without triggering traffic, if\n      register contents are invalid at the time the BM2_START bit is written to '1' by firmware. (R/WC)\n      Examples of a Bad Request are:\n      Length of zero, or Length greater than 4K (1000h)\n      Host Address and Length together specifying a request that crosses a 4KByte boundary. This might violate the Scatter/Gather\n      structure of the Host memory, so is not allowed. Mask */
#define ESPI_MEMORY_BUS_MASTER_STATUS_Msk     (0x0BFF0BFFUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_INT_EN : (ESPI_MEMORY Offset: 0x204) (R/W 32) Bus Master Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t BM1_TRANSFER_DONE_EN:1;    /**< bit:      0  When this bit is '1' an interrupt is generated when the bit BM1_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t BM2_TRANSFER_DONE_EN:1;    /**< bit:      1  When this bit is '1' an interrupt is generated when the bit BM2_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_INT_EN_bits_t;
