ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_BUS_MASTER_INT_EN_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_INT_EN) Bus Master Interrupt Enable Register  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_INT_EN_BM1_TRANSFER_DONE_EN_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) When this bit is '1' an interrupt is generated when the bit BM1_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_MEMORY_BUS_MASTER_INT_EN_BM1_TRANSFER_DONE_EN_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_INT_EN_BM1_TRANSFER_DONE_EN_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) When this bit is '1' an interrupt is generated when the bit BM1_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_MEMORY_BUS_MASTER_INT_EN_BM2_TRANSFER_DONE_EN_Pos (1)                                            /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) When this bit is '1' an interrupt is generated when the bit BM2_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Position */
#define ESPI_MEMORY_BUS_MASTER_INT_EN_BM2_TRANSFER_DONE_EN_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_INT_EN_BM2_TRANSFER_DONE_EN_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) When this bit is '1' an interrupt is generated when the bit BM2_TRANSFER_DONE in the Bus Master Status Register is 1.\n      When this bit is '0', the status bit will not generate an interrupt. Mask */
#define ESPI_MEMORY_BUS_MASTER_INT_EN_Msk     (0x00000003UL)                                 /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_CONFIG : (ESPI_MEMORY Offset: 0x208) (R/W 32) Bus Master Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t BM1_TAG:4;                 /**< bit:   0..3  This 4-bit Tag value is included in all eSPI traffic originating from the BM1 Bus Master instance.\n      This bit should not be modified while the bit BM1_BUSY in the Bus Master Status Register is '1'. */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t BM2_TAG:4;                 /**< bit: 16..19  This 4-bit Tag value is included in all eSPI traffic originating from the BM2 Bus Master instance.\n      This bit should not be modified while the bit BM2_BUSY in the Bus Master Status Register is '1'. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_CONFIG_bits_t;
#define ESPI_MEMORY_BUS_MASTER_CONFIG_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_CONFIG) Bus Master Configuration Register  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) This 4-bit Tag value is included in all eSPI traffic originating from the BM1 Bus Master instance.\n      This bit should not be modified while the bit BM1_BUSY in the Bus Master Status Register is '1'. Position */
#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG_Msk (0xFU << ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) This 4-bit Tag value is included in all eSPI traffic originating from the BM1 Bus Master instance.\n      This bit should not be modified while the bit BM1_BUSY in the Bus Master Status Register is '1'. Mask */
#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG(value) (ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_CONFIG_BM1_TAG_Pos))
#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG_Pos (16)                                           /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) This 4-bit Tag value is included in all eSPI traffic originating from the BM2 Bus Master instance.\n      This bit should not be modified while the bit BM2_BUSY in the Bus Master Status Register is '1'. Position */
#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG_Msk (0xFU << ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) This 4-bit Tag value is included in all eSPI traffic originating from the BM2 Bus Master instance.\n      This bit should not be modified while the bit BM2_BUSY in the Bus Master Status Register is '1'. Mask */
#define ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG(value) (ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_CONFIG_BM2_TAG_Pos))
#define ESPI_MEMORY_BUS_MASTER_CONFIG_Msk     (0x000F000FUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_1_CONTROL : (ESPI_MEMORY Offset: 0x210) (R/W 32) Bus Master 1 Control Register -------- */

typedef union
{
  struct
  {
    uint32_t BM1_START:1;               /**< bit:      0  A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 1. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. */
    uint32_t BM1_ABORT:1;               /**< bit:      1  A write of '1' to this bit will cause an active transfer on Bus Master Channel 1 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. */
    uint32_t BM1_ENABLE_INTERNAL_INCR:1;  /**< bit:      2  1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. */
    uint32_t BM1_WAIT_BM2_NOT_BUSY:1;   /**< bit:      3  1=The transfer on Bus Master Channel 1 will be held until a transfer in progress on Bus Master Channel 2 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM1_ABORTED_BY_CH2_ERROR flag set.\n      0=The transfer on Bus Master Channel 1 will proceed independently of the status of Bus Master Channel 2. */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t BM1_CYCLE_TYPE:2;          /**< bit:   8..9  This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t BM1_LENGTH:13;             /**< bit: 16..28  This field sets the length in bytes of a transfer on Bus Master Channel 1. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 1 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_1_CONTROL_bits_t;
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_1_CONTROL) Bus Master 1 Control Register  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_START_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 1. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_START_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_START_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 1. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ABORT_Pos (1)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) A write of '1' to this bit will cause an active transfer on Bus Master Channel 1 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ABORT_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ABORT_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) A write of '1' to this bit will cause an active transfer on Bus Master Channel 1 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ENABLE_INTERNAL_INCR_Pos (2)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) 1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ENABLE_INTERNAL_INCR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_ENABLE_INTERNAL_INCR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) 1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_WAIT_BM2_NOT_BUSY_Pos (3)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) 1=The transfer on Bus Master Channel 1 will be held until a transfer in progress on Bus Master Channel 2 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM1_ABORTED_BY_CH2_ERROR flag set.\n      0=The transfer on Bus Master Channel 1 will proceed independently of the status of Bus Master Channel 2. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_WAIT_BM2_NOT_BUSY_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_WAIT_BM2_NOT_BUSY_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) 1=The transfer on Bus Master Channel 1 will be held until a transfer in progress on Bus Master Channel 2 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM1_ABORTED_BY_CH2_ERROR flag set.\n      0=The transfer on Bus Master Channel 1 will proceed independently of the status of Bus Master Channel 2. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE_Pos (8)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE_Msk (0x3U << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE(value) (ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_CYCLE_TYPE_Pos))
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH_Pos (16)                                           /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) This field sets the length in bytes of a transfer on Bus Master Channel 1. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 1 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. Position */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH_Msk (0x1FFFU << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) This field sets the length in bytes of a transfer on Bus Master Channel 1. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 1 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH(value) (ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_1_CONTROL_BM1_LENGTH_Pos))
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_Msk  (0x1FFF030FUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0 : (ESPI_MEMORY Offset: 0x214) (R/W 32) Bus Master 1 Host Address Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t BM1_HOST_ADDRESS_LSDW:32;  /**< bit:  0..31  This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_bits_t;
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0) Bus Master 1 Host Address Register (DWord 0)  Reset Value */

