ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0) This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Position */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW_Msk (0xFFFFFFFFU << ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0) This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW(value) (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_BM1_HOST_ADDRESS_LSDW_Pos))
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_Msk (0xFFFFFFFFUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1 : (ESPI_MEMORY Offset: 0x218) (R/W 32) Bus Master 1 Host Address Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t BM1_HOST_ADDRESS_MSDW:32;  /**< bit:  0..31  This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_bits_t;
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1) Bus Master 1 Host Address Register (DWord 1)  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1) This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Position */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW_Msk (0xFFFFFFFFU << ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1) This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 1. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW(value) (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_BM1_HOST_ADDRESS_MSDW_Pos))
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_Msk (0xFFFFFFFFUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR : (ESPI_MEMORY Offset: 0x21c) (R/W 32) Bus Master 1 Internal Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t BM1_INTERNAL_ADDRESS:30;   /**< bit:  2..31  This register sets the internal address to be used for a transfer on Bus Master Channel 1. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_bits_t;
#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR) Bus Master 1 Internal Address Register  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS_Pos (2)                                            /**< (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR) This register sets the internal address to be used for a transfer on Bus Master Channel 1. Position */
#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS_Msk (0x3FFFFFFFU << ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR) This register sets the internal address to be used for a transfer on Bus Master Channel 1. Mask */
#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS(value) (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_BM1_INTERNAL_ADDRESS_Pos))
#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_Msk (0xFFFFFFFCUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_2_CONTROL : (ESPI_MEMORY Offset: 0x224) (R/W 32) Bus Master 2 Control Register -------- */

typedef union
{
  struct
  {
    uint32_t BM2_START:1;               /**< bit:      0  A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 2. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. */
    uint32_t BM2_ABORT:1;               /**< bit:      1  A write of '1' to this bit will cause an active transfer on Bus Master Channel 2 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. */
    uint32_t BM2_ENABLE_INTERNAL_INCR:1;  /**< bit:      2  1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. */
    uint32_t BM2_WAIT_BM1_NOT_BUSY:1;   /**< bit:      3  1=The transfer on Bus Master Channel 2 will be held until a transfer in progress on Bus Master Channel 1 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM2_ABORTED_BY_CH1_ERROR flag set.\n      0=The transfer on Bus Master Channel 2 will proceed independently of the status of Bus Master Channel 1. */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t BM2_CYCLE_TYPE:2;          /**< bit:   8..9  This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. */
    uint32_t :6;                        /**< bit: 10..15  Reserved                                      */
    uint32_t BM2_LENGTH:13;             /**< bit: 16..28  This field sets the length in bytes of a transfer on Bus Master Channel 2. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 2 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_2_CONTROL_bits_t;
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_2_CONTROL) Bus Master 2 Control Register  Reset Value */

