ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_START_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 2. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_START_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_START_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) A write of '1' to this bit starts a Bus Master transfer on Bus Master Channel 2. A write of 0 has no effect. Reads of this bit \n      return 0. The transmission will be inhibited if the Peripheral channel is not Ready, as defined in the eSPI Peripheral Channel Ready Register. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ABORT_Pos (1)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) A write of '1' to this bit will cause an active transfer on Bus Master Channel 2 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ABORT_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ABORT_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) A write of '1' to this bit will cause an active transfer on Bus Master Channel 2 to terminate at the next point allowed by\n      the eSPI protocol. A write of 0 has no effect. Reads of this bit return 0. If this bit is written to 1 by firmware, there is no guarantee\n      that any data will have been transferred. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ENABLE_INTERNAL_INCR_Pos (2)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) 1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ENABLE_INTERNAL_INCR_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_ENABLE_INTERNAL_INCR_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) 1=The internal address will be incremented after each transfer to eSPI\n      0=The internal address will remain fixed for the entire Bus Master transfer. This may be used to transfer data to or from an on-chip\n      FIFO instead of a region of memory, or to fill a region of Host memory from a single byte value. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_WAIT_BM1_NOT_BUSY_Pos (3)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) 1=The transfer on Bus Master Channel 2 will be held until a transfer in progress on Bus Master Channel 1 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM2_ABORTED_BY_CH1_ERROR flag set.\n      0=The transfer on Bus Master Channel 2 will proceed independently of the status of Bus Master Channel 1. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_WAIT_BM1_NOT_BUSY_Msk (0x1U << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_WAIT_BM1_NOT_BUSY_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) 1=The transfer on Bus Master Channel 2 will be held until a transfer in progress on Bus Master Channel 1 has completed.\n      If that transfer completes unsuccessfully, then this transfer will also terminate, before generating any traffic, with the\n      BM2_ABORTED_BY_CH1_ERROR flag set.\n      0=The transfer on Bus Master Channel 2 will proceed independently of the status of Bus Master Channel 1. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE_Pos (8)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE_Msk (0x3U << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) This field provides the cycle type to use inside the eSPI transaction header:\n      11b=Memory Write, 64-bit addressing\n      10b=Memory Read, 64-bit addressing\n      01b=Memory Write, 32-bit addressing\n      00b=Memory Read, 32-bit addressing. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE(value) (ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_CYCLE_TYPE_Pos))
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH_Pos (16)                                           /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) This field sets the length in bytes of a transfer on Bus Master Channel 2. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 2 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. Position */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH_Msk (0x1FFFU << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) This field sets the length in bytes of a transfer on Bus Master Channel 2. A value of zero, or a value greater than exactly\n      4K (0x1000) is illegal. Any length which, in combination with the Bus Master 2 Host Address register, will cause the transfer to cross\n      a 4K-byte boundary in System Memory is also illegal. These illegal settings will cause a request to terminate immediately, with no\n      traffic, and with Bad Request error status posted. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH(value) (ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_2_CONTROL_BM2_LENGTH_Pos))
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_Msk  (0x1FFF030FUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0 : (ESPI_MEMORY Offset: 0x228) (R/W 32) Bus Master 2 Host Address Register (DWord 0) -------- */

typedef union
{
  struct
  {
    uint32_t BM2_HOST_ADDRESS_LSDW:32;  /**< bit:  0..31  This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_bits_t;
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0) Bus Master 2 Host Address Register (DWord 0)  Reset Value */

