ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0) This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Position */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW_Msk (0xFFFFFFFFU << ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0) This register sets bits [31:0] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW(value) (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_BM2_HOST_ADDRESS_LSDW_Pos))
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_Msk (0xFFFFFFFFUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1 : (ESPI_MEMORY Offset: 0x22c) (R/W 32) Bus Master 2 Host Address Register (DWord 1) -------- */

typedef union
{
  struct
  {
    uint32_t BM2_HOST_ADDRESS_MSDW:32;  /**< bit:  0..31  This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_bits_t;
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1) Bus Master 2 Host Address Register (DWord 1)  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW_Pos (0)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1) This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Position */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW_Msk (0xFFFFFFFFU << ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1) This register sets bits [63:32] of the Host address used for a transfer on Bus Master Channel 2. This address, combined with\n      the Length, must not cross a 4K boundary, or else the START request will terminate without traffic, posting the Bad Request error status. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW(value) (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_BM2_HOST_ADDRESS_MSDW_Pos))
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_Msk (0xFFFFFFFFUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1) Register Mask  */

/* -------- ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR : (ESPI_MEMORY Offset: 0x230) (R/W 32) Bus Master 2 Internal Address Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t BM2_INTERNAL_ADDRESS:30;   /**< bit:  2..31  This register sets the internal address to be used for a transfer on Bus Master Channel 2. */
  };
  uint32_t w;
} __ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_bits_t;
#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR) Bus Master 2 Internal Address Register  Reset Value */

#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS_Pos (2)                                            /**< (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR) This register sets the internal address to be used for a transfer on Bus Master Channel 2. Position */
#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS_Msk (0x3FFFFFFFU << ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS_Pos)  /**< (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR) This register sets the internal address to be used for a transfer on Bus Master Channel 2. Mask */
#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS(value) (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS_Msk & ((value) << ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_BM2_INTERNAL_ADDRESS_Pos))
#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_Msk (0xFFFFFFFCUL)                                 /**< (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR) Register Mask  */

/* -------- ESPI_MEMORY_MBX_MEM_BAR_CFG_W0 : (ESPI_MEMORY Offset: 0x330) (R/W 16) Mailbox Memory BAR Configuration Register (Word 0) -------- */

typedef union
{
  struct
  {
    uint16_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. */
    uint16_t :15;                       /**< bit:  1..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_bits_t;
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_MBX_MEM_BAR_CFG_W0) Mailbox Memory BAR Configuration Register (Word 0)  Reset Value */

#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_VALID_Pos (0)                                            /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Position */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_VALID_Msk (0x1U << ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_VALID_Pos)  /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Mask */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_Msk    (0x00000001UL)                                 /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W0) Register Mask  */

