ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_VALID_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_VALID_Msk (0x1U << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_VALID_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1 : (ESPI_MEMORY Offset: 0x33c) (R/W 16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 1) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W0:16;   /**< bit:  0..15  Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_RESETVALUE (0x62U)                                       /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1) ACPI EC Channel 0 Memory BAR Configuration Register (Word 1)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1) Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Msk (0xFFFFU << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1) Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2 : (ESPI_MEMORY Offset: 0x33e) (R/W 16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 2) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W1:16;   /**< bit:  0..15  Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2) ACPI EC Channel 0 Memory BAR Configuration Register (Word 2)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2) Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Msk (0xFFFFU << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2) Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3 : (ESPI_MEMORY Offset: 0x340) (R/W 16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 3) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W2:16;   /**< bit:  0..15  Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3) ACPI EC Channel 0 Memory BAR Configuration Register (Word 3)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3) Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Msk (0xFFFFU << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3) Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4 : (ESPI_MEMORY Offset: 0x342) (R/W 16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 4) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W3:16;   /**< bit:  0..15  Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_bits_t;
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4) ACPI EC Channel 0 Memory BAR Configuration Register (Word 4)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4) Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Msk (0xFFFFU << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos)  /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4) Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3(value) (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Msk & ((value) << ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos))
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0 : (ESPI_MEMORY Offset: 0x344) (R/W 16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 0) -------- */

typedef union
{
  struct
  {
    uint16_t VALID:1;                   /**< bit:      0  1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. */
    uint16_t :15;                       /**< bit:  1..15  Reserved                                      */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_bits_t;
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0) ACPI EC Channel 1 Memory BAR Configuration Register (Word 0)  Reset Value */

#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_VALID_Pos (0)                                            /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Position */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_VALID_Msk (0x1U << ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_VALID_Pos)  /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Mask */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0) Register Mask  */

/* -------- ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W1 : (ESPI_MEMORY Offset: 0x346) (R/W 16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 1) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W0:16;   /**< bit:  0..15  Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W1_bits_t;
