ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_VALID_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_VALID_Msk (0x1U << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_VALID_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0) 1=The BAR is valid and will participate in eSPI matches. 0=The BAR is ignored. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_Msk (0x00000001UL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1 : (ESPI_MEMORY Offset: 0x3b8) (R/W 16) SRAM BAR 1 Configuration Register (Word 1) ) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W0:16;   /**< bit:  0..15  Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1) SRAM BAR 1 Configuration Register (Word 1) )  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1) Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1) Bits[15:0] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0(value) (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_ESPI_HOST_ADDRESS_W0_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2 : (ESPI_MEMORY Offset: 0x3ba) (R/W 16) SRAM BAR 1 Configuration Register (Word 2) ) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W1:16;   /**< bit:  0..15  Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2) SRAM BAR 1 Configuration Register (Word 2) )  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2) Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2) Bits[31:16] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1(value) (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_ESPI_HOST_ADDRESS_W1_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3 : (ESPI_MEMORY Offset: 0x3bc) (R/W 16) SRAM BAR 1 Configuration Register (Word 3) ) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W2:16;   /**< bit:  0..15  Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3) SRAM BAR 1 Configuration Register (Word 3) )  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3) Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3) Bits[47:32] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2(value) (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_ESPI_HOST_ADDRESS_W2_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3) Register Mask  */

/* -------- ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4 : (ESPI_MEMORY Offset: 0x3be) (R/W 16) SRAM BAR 1 Configuration Register (Word 4) ) -------- */

typedef union
{
  struct
  {
    uint16_t ESPI_HOST_ADDRESS_W3:16;   /**< bit:  0..15  Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. */
  };
  uint16_t w;
} __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_bits_t;
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_RESETVALUE (0x00U)                                       /**<  (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4) SRAM BAR 1 Configuration Register (Word 4) )  Reset Value */

#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos (0)                                            /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4) Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. Position */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Msk (0xFFFFU << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos)  /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4) Bits[63:48] of the 64 bits that are used to match eSPI memory addresses. Mask */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3(value) (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Msk & ((value) << ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_ESPI_HOST_ADDRESS_W3_Pos))
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_Msk (0x0000FFFFUL)                                 /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4) Register Mask  */

/** \brief ESPI_MEMORY register offsets definitions */
#define ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_OFFSET (0x130)        /**< (ESPI_MEMORY_MBX_MEM_BASE_ADDRESS) Mailbox Memory Base Address Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_OFFSET (0x13A)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB) ACPI EC Channel 0 Memory BAR (LSB) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_OFFSET (0x13C)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB) ACPI EC Channel 0 Memory BAR (MSB) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_OFFSET (0x144)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS) ACPI EC Channel 1 Memory BAR Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_OFFSET (0x14E)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB) ACPI EC Channel 2 Memory BAR (LSB) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_OFFSET (0x150)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB) ACPI EC Channel 2 Memory BAR (MSB) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_OFFSET (0x158)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS) ACPI EC Channel 3 Memory BAR Offset */
#define ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_OFFSET (0x16C)        /**< (ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS) Embedded Memory Interface (EMI) 0 Memory Base Address Offset */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_OFFSET (0x176)        /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB) Embedded Memory Interface (EMI) 1 Memory Base Address (LSB) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_OFFSET (0x178)        /**< (ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB) Embedded Memory Interface (EMI) 1 Memory Base Address (MSB) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_OFFSET (0x1AC)        /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF) SRAM 0 Memory Base Address Config Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_OFFSET (0x1AE)        /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB) SRAM 0 Memory Base Address LSB Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_OFFSET (0x1B0)        /**< (ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB) SRAM 0 Memory Base Address MSB Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_OFFSET (0x1B6)        /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF) SRAM 1 Memory Base Address Config Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_OFFSET (0x1B8)        /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB) SRAM 1 Memory Base Address LSB Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_OFFSET (0x1BA)        /**< (ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB) SRAM 1 Memory Base Address MSB Offset */
#define ESPI_MEMORY_BUS_MASTER_STATUS_OFFSET (0x200)        /**< (ESPI_MEMORY_BUS_MASTER_STATUS) Bus Master Status Register Offset */
#define ESPI_MEMORY_BUS_MASTER_INT_EN_OFFSET (0x204)        /**< (ESPI_MEMORY_BUS_MASTER_INT_EN) Bus Master Interrupt Enable Register Offset */
#define ESPI_MEMORY_BUS_MASTER_CONFIG_OFFSET (0x208)        /**< (ESPI_MEMORY_BUS_MASTER_CONFIG) Bus Master Configuration Register Offset */
#define ESPI_MEMORY_BUS_MASTER_1_CONTROL_OFFSET (0x210)        /**< (ESPI_MEMORY_BUS_MASTER_1_CONTROL) Bus Master 1 Control Register Offset */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_OFFSET (0x214)        /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0) Bus Master 1 Host Address Register (DWord 0) Offset */
#define ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_OFFSET (0x218)        /**< (ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1) Bus Master 1 Host Address Register (DWord 1) Offset */
#define ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_OFFSET (0x21C)        /**< (ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR) Bus Master 1 Internal Address Register Offset */
#define ESPI_MEMORY_BUS_MASTER_2_CONTROL_OFFSET (0x224)        /**< (ESPI_MEMORY_BUS_MASTER_2_CONTROL) Bus Master 2 Control Register Offset */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_OFFSET (0x228)        /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0) Bus Master 2 Host Address Register (DWord 0) Offset */
#define ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_OFFSET (0x22C)        /**< (ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1) Bus Master 2 Host Address Register (DWord 1) Offset */
#define ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_OFFSET (0x230)        /**< (ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR) Bus Master 2 Internal Address Register Offset */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_OFFSET (0x330)        /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W0) Mailbox Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W1_OFFSET (0x332)        /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W1) Mailbox Memory BAR Configuration Register (Word 1) Offset */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W2_OFFSET (0x334)        /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W2) Mailbox Memory BAR Configuration Register (Word 2) Offset */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W3_OFFSET (0x336)        /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W3) Mailbox Memory BAR Configuration Register (Word 3) Offset */
#define ESPI_MEMORY_MBX_MEM_BAR_CFG_W4_OFFSET (0x338)        /**< (ESPI_MEMORY_MBX_MEM_BAR_CFG_W4) Mailbox Memory BAR Configuration Register (Word 4) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_OFFSET (0x33A)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0) ACPI EC Channel 0 Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_OFFSET (0x33C)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1) ACPI EC Channel 0 Memory BAR Configuration Register (Word 1) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_OFFSET (0x33E)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2) ACPI EC Channel 0 Memory BAR Configuration Register (Word 2) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_OFFSET (0x340)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3) ACPI EC Channel 0 Memory BAR Configuration Register (Word 3) Offset */
#define ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_OFFSET (0x342)        /**< (ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4) ACPI EC Channel 0 Memory BAR Configuration Register (Word 4) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_OFFSET (0x344)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0) ACPI EC Channel 1 Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W1_OFFSET (0x346)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W1) ACPI EC Channel 1 Memory BAR Configuration Register (Word 1) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W2_OFFSET (0x348)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W2) ACPI EC Channel 1 Memory BAR Configuration Register (Word 2) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W3_OFFSET (0x34A)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W3) ACPI EC Channel 1 Memory BAR Configuration Register (Word 3) Offset */
#define ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W4_OFFSET (0x34C)        /**< (ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W4) ACPI EC Channel 1 Memory BAR Configuration Register (Word 4) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W0_OFFSET (0x34E)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W0) ACPI EC Channel 2 Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W1_OFFSET (0x350)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W1) ACPI EC Channel 2 Memory BAR Configuration Register (Word 1) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W2_OFFSET (0x352)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W2) ACPI EC Channel 2 Memory BAR Configuration Register (Word 2) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W3_OFFSET (0x354)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W3) ACPI EC Channel 2 Memory BAR Configuration Register (Word 3) Offset */
#define ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W4_OFFSET (0x356)        /**< (ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W4) ACPI EC Channel 2 Memory BAR Configuration Register (Word 4) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W0_OFFSET (0x358)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W0) ACPI EC Channel 3 Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W1_OFFSET (0x35A)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W1) ACPI EC Channel 3 Memory BAR Configuration Register (Word 1) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W2_OFFSET (0x35C)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W2) ACPI EC Channel 3 Memory BAR Configuration Register (Word 2) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W3_OFFSET (0x35E)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W3) ACPI EC Channel 3 Memory BAR Configuration Register (Word 3) Offset */
#define ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W4_OFFSET (0x360)        /**< (ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W4) ACPI EC Channel 3 Memory BAR Configuration Register (Word 4) Offset */
#define ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W0_OFFSET (0x36C)        /**< (ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W0) EMI 0 Memory BAR Configuration Register (Word 0) Offset */
#define ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W1_OFFSET (0x36E)        /**< (ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W1) EMI 0 Memory BAR Configuration Address Register  (Word 1) Offset */
#define ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W2_OFFSET (0x370)        /**< (ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W2) EMI 0 Memory BAR Configuration Address Register  (Word 2) Offset */
#define ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W3_OFFSET (0x372)        /**< (ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W3) EMI 0 Memory BAR Configuration Address Register  (Word 3) Offset */
#define ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W4_OFFSET (0x374)        /**< (ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W4) EMI 0 Memory BAR Configuration Address Register  (Word 4) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W0_OFFSET (0x376)        /**< (ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W0) EMI 1 Memory BAR Configuration Register (Word 0) ) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W1_OFFSET (0x378)        /**< (ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W1) EMI 1 Memory BAR Configuration Register (Word 1) ) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W2_OFFSET (0x37A)        /**< (ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W2) EMI 1 Memory BAR Configuration Register (Word 2) ) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W3_OFFSET (0x37C)        /**< (ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W3) EMI 1 Memory BAR Configuration Register (Word 3) ) Offset */
#define ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W4_OFFSET (0x37E)        /**< (ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W4) EMI 1 Memory BAR Configuration Register (Word 4) ) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W0_OFFSET (0x3AC)        /**< (ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W0) SRAM BAR 0 Configuration Register (Word 0) ) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W1_OFFSET (0x3AE)        /**< (ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W1) SRAM BAR 0 Configuration Register (Word 1) ) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W2_OFFSET (0x3B0)        /**< (ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W2) SRAM BAR 0 Configuration Register (Word 2) ) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W3_OFFSET (0x3B2)        /**< (ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W3) SRAM BAR 0 Configuration Register (Word 3) ) Offset */
#define ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W4_OFFSET (0x3B4)        /**< (ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W4) SRAM BAR 0 Configuration Register (Word 4) ) Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_OFFSET (0x3B6)        /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0) SRAM BAR 1 Configuration Register (Word 0) ) Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_OFFSET (0x3B8)        /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1) SRAM BAR 1 Configuration Register (Word 1) ) Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_OFFSET (0x3BA)        /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2) SRAM BAR 1 Configuration Register (Word 2) ) Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_OFFSET (0x3BC)        /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3) SRAM BAR 1 Configuration Register (Word 3) ) Offset */
#define ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_OFFSET (0x3BE)        /**< (ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4) SRAM BAR 1 Configuration Register (Word 4) ) Offset */

