ranjithaguna/pv/LED_Demo/source/pic32cx/component/espi_memory.h
/** \brief ESPI_MEMORY register API structure */
typedef struct
{  /* The eSPI Memory Component is one of two Logical Devices (along with the I/O Component) that provide access to all the\n    registers in the device. */
  __IO  __ESPI_MEMORY_MBX_MEM_BASE_ADDRESS_bits_t MBX_MEM_BASE_ADDRESS; /**< Offset: 0x130 (R/W  32) Mailbox Memory Base Address */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_LSB_bits_t ACPI_EC_0_MEM_BASE_ADDRESS_LSB; /**< Offset: 0x13A (R/W  16) ACPI EC Channel 0 Memory BAR (LSB) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BASE_ADDRESS_MSB_bits_t ACPI_EC_0_MEM_BASE_ADDRESS_MSB; /**< Offset: 0x13C (R/W  16) ACPI EC Channel 0 Memory BAR (MSB) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BASE_ADDRESS_bits_t ACPI_EC_1_MEM_BASE_ADDRESS; /**< Offset: 0x144 (R/W  32) ACPI EC Channel 1 Memory BAR */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_LSB_bits_t ACPI_EC_2_MEM_BASE_ADDRESS_LSB; /**< Offset: 0x14E (R/W  16) ACPI EC Channel 2 Memory BAR (LSB) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BASE_ADDRESS_MSB_bits_t ACPI_EC_2_MEM_BASE_ADDRESS_MSB; /**< Offset: 0x150 (R/W  16) ACPI EC Channel 2 Memory BAR (MSB) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BASE_ADDRESS_bits_t ACPI_EC_3_MEM_BASE_ADDRESS; /**< Offset: 0x158 (R/W  32) ACPI EC Channel 3 Memory BAR */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BASE_ADDRESS_bits_t EMI_0_MEM_BASE_ADDRESS; /**< Offset: 0x16C (R/W  32) Embedded Memory Interface (EMI) 0 Memory Base Address */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_LSB_bits_t EMI_1_MEM_BASE_ADDRESS_LSB; /**< Offset: 0x176 (R/W  16) Embedded Memory Interface (EMI) 1 Memory Base Address (LSB) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BASE_ADDRESS_MSB_bits_t EMI_1_MEM_BASE_ADDRESS_MSB; /**< Offset: 0x178 (R/W  16) Embedded Memory Interface (EMI) 1 Memory Base Address (MSB) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_CONF_bits_t SRAM_0_MEM_BASE_ADDRESS_CONF; /**< Offset: 0x1AC (R/W  16) SRAM 0 Memory Base Address Config */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_LSB_bits_t SRAM_0_MEM_BASE_ADDRESS_LSB; /**< Offset: 0x1AE (R/W  16) SRAM 0 Memory Base Address LSB */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BASE_ADDRESS_MSB_bits_t SRAM_0_MEM_BASE_ADDRESS_MSB; /**< Offset: 0x1B0 (R/W  32) SRAM 0 Memory Base Address MSB */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_CONF_bits_t SRAM_1_MEM_BASE_ADDRESS_CONF; /**< Offset: 0x1B6 (R/W  16) SRAM 1 Memory Base Address Config */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_LSB_bits_t SRAM_1_MEM_BASE_ADDRESS_LSB; /**< Offset: 0x1B8 (R/W  16) SRAM 1 Memory Base Address LSB */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BASE_ADDRESS_MSB_bits_t SRAM_1_MEM_BASE_ADDRESS_MSB; /**< Offset: 0x1BA (R/W  16) SRAM 1 Memory Base Address MSB */
  __IO  __ESPI_MEMORY_BUS_MASTER_STATUS_bits_t BUS_MASTER_STATUS; /**< Offset: 0x200 (R/W  32) Bus Master Status Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_INT_EN_bits_t BUS_MASTER_INT_EN; /**< Offset: 0x204 (R/W  32) Bus Master Interrupt Enable Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_CONFIG_bits_t BUS_MASTER_CONFIG; /**< Offset: 0x208 (R/W  32) Bus Master Configuration Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_1_CONTROL_bits_t BUS_MASTER_1_CONTROL; /**< Offset: 0x210 (R/W  32) Bus Master 1 Control Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW0_bits_t BUS_MASTER_1_HOST_ADDR_DW0; /**< Offset: 0x214 (R/W  32) Bus Master 1 Host Address Register (DWord 0) */
  __IO  __ESPI_MEMORY_BUS_MASTER_1_HOST_ADDR_DW1_bits_t BUS_MASTER_1_HOST_ADDR_DW1; /**< Offset: 0x218 (R/W  32) Bus Master 1 Host Address Register (DWord 1) */
  __IO  __ESPI_MEMORY_BUS_MASTER_1_INTERNAL_ADDR_bits_t BUS_MASTER_1_INTERNAL_ADDR; /**< Offset: 0x21C (R/W  32) Bus Master 1 Internal Address Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_2_CONTROL_bits_t BUS_MASTER_2_CONTROL; /**< Offset: 0x224 (R/W  32) Bus Master 2 Control Register */
  __IO  __ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW0_bits_t BUS_MASTER_2_HOST_ADDR_DW0; /**< Offset: 0x228 (R/W  32) Bus Master 2 Host Address Register (DWord 0) */
  __IO  __ESPI_MEMORY_BUS_MASTER_2_HOST_ADDR_DW1_bits_t BUS_MASTER_2_HOST_ADDR_DW1; /**< Offset: 0x22C (R/W  32) Bus Master 2 Host Address Register (DWord 1) */
  __IO  __ESPI_MEMORY_BUS_MASTER_2_INTERNAL_ADDR_bits_t BUS_MASTER_2_INTERNAL_ADDR; /**< Offset: 0x230 (R/W  32) Bus Master 2 Internal Address Register */
  __IO  __ESPI_MEMORY_MBX_MEM_BAR_CFG_W0_bits_t MBX_MEM_BAR_CFG_W0; /**< Offset: 0x330 (R/W  16) Mailbox Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_MBX_MEM_BAR_CFG_W1_bits_t MBX_MEM_BAR_CFG_W1; /**< Offset: 0x332 (R/W  16) Mailbox Memory BAR Configuration Register (Word 1) */
  __IO  __ESPI_MEMORY_MBX_MEM_BAR_CFG_W2_bits_t MBX_MEM_BAR_CFG_W2; /**< Offset: 0x334 (R/W  16) Mailbox Memory BAR Configuration Register (Word 2) */
  __IO  __ESPI_MEMORY_MBX_MEM_BAR_CFG_W3_bits_t MBX_MEM_BAR_CFG_W3; /**< Offset: 0x336 (R/W  16) Mailbox Memory BAR Configuration Register (Word 3) */
  __IO  __ESPI_MEMORY_MBX_MEM_BAR_CFG_W4_bits_t MBX_MEM_BAR_CFG_W4; /**< Offset: 0x338 (R/W  16) Mailbox Memory BAR Configuration Register (Word 4) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W0_bits_t ACPI_EC_0_MEM_BAR_CFG_W0; /**< Offset: 0x33A (R/W  16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W1_bits_t ACPI_EC_0_MEM_BAR_CFG_W1; /**< Offset: 0x33C (R/W  16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 1) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W2_bits_t ACPI_EC_0_MEM_BAR_CFG_W2; /**< Offset: 0x33E (R/W  16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 2) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W3_bits_t ACPI_EC_0_MEM_BAR_CFG_W3; /**< Offset: 0x340 (R/W  16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 3) */
  __IO  __ESPI_MEMORY_ACPI_EC_0_MEM_BAR_CFG_W4_bits_t ACPI_EC_0_MEM_BAR_CFG_W4; /**< Offset: 0x342 (R/W  16) ACPI EC Channel 0 Memory BAR Configuration Register (Word 4) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W0_bits_t ACPI_EC_1_MEM_BAR_CFG_W0; /**< Offset: 0x344 (R/W  16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W1_bits_t ACPI_EC_1_MEM_BAR_CFG_W1; /**< Offset: 0x346 (R/W  16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 1) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W2_bits_t ACPI_EC_1_MEM_BAR_CFG_W2; /**< Offset: 0x348 (R/W  16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 2) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W3_bits_t ACPI_EC_1_MEM_BAR_CFG_W3; /**< Offset: 0x34A (R/W  16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 3) */
  __IO  __ESPI_MEMORY_ACPI_EC_1_MEM_BAR_CFG_W4_bits_t ACPI_EC_1_MEM_BAR_CFG_W4; /**< Offset: 0x34C (R/W  16) ACPI EC Channel 1 Memory BAR Configuration Register (Word 4) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W0_bits_t ACPI_EC_2_MEM_BAR_CFG_W0; /**< Offset: 0x34E (R/W  16) ACPI EC Channel 2 Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W1_bits_t ACPI_EC_2_MEM_BAR_CFG_W1; /**< Offset: 0x350 (R/W  16) ACPI EC Channel 2 Memory BAR Configuration Register (Word 1) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W2_bits_t ACPI_EC_2_MEM_BAR_CFG_W2; /**< Offset: 0x352 (R/W  16) ACPI EC Channel 2 Memory BAR Configuration Register (Word 2) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W3_bits_t ACPI_EC_2_MEM_BAR_CFG_W3; /**< Offset: 0x354 (R/W  16) ACPI EC Channel 2 Memory BAR Configuration Register (Word 3) */
  __IO  __ESPI_MEMORY_ACPI_EC_2_MEM_BAR_CFG_W4_bits_t ACPI_EC_2_MEM_BAR_CFG_W4; /**< Offset: 0x356 (R/W  16) ACPI EC Channel 2 Memory BAR Configuration Register (Word 4) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W0_bits_t ACPI_EC_3_MEM_BAR_CFG_W0; /**< Offset: 0x358 (R/W  16) ACPI EC Channel 3 Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W1_bits_t ACPI_EC_3_MEM_BAR_CFG_W1; /**< Offset: 0x35A (R/W  16) ACPI EC Channel 3 Memory BAR Configuration Register (Word 1) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W2_bits_t ACPI_EC_3_MEM_BAR_CFG_W2; /**< Offset: 0x35C (R/W  16) ACPI EC Channel 3 Memory BAR Configuration Register (Word 2) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W3_bits_t ACPI_EC_3_MEM_BAR_CFG_W3; /**< Offset: 0x35E (R/W  16) ACPI EC Channel 3 Memory BAR Configuration Register (Word 3) */
  __IO  __ESPI_MEMORY_ACPI_EC_3_MEM_BAR_CFG_W4_bits_t ACPI_EC_3_MEM_BAR_CFG_W4; /**< Offset: 0x360 (R/W  16) ACPI EC Channel 3 Memory BAR Configuration Register (Word 4) */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W0_bits_t EMI_0_MEM_BAR_CFG_W0; /**< Offset: 0x36C (R/W  16) EMI 0 Memory BAR Configuration Register (Word 0) */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W1_bits_t EMI_0_MEM_BAR_CFG_W1; /**< Offset: 0x36E (R/W  16) EMI 0 Memory BAR Configuration Address Register  (Word 1) */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W2_bits_t EMI_0_MEM_BAR_CFG_W2; /**< Offset: 0x370 (R/W  16) EMI 0 Memory BAR Configuration Address Register  (Word 2) */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W3_bits_t EMI_0_MEM_BAR_CFG_W3; /**< Offset: 0x372 (R/W  16) EMI 0 Memory BAR Configuration Address Register  (Word 3) */
  __IO  __ESPI_MEMORY_EMI_0_MEM_BAR_CFG_W4_bits_t EMI_0_MEM_BAR_CFG_W4; /**< Offset: 0x374 (R/W  16) EMI 0 Memory BAR Configuration Address Register  (Word 4) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W0_bits_t EMI_1_MEM_BAR_CFG_W0; /**< Offset: 0x376 (R/W  16) EMI 1 Memory BAR Configuration Register (Word 0) ) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W1_bits_t EMI_1_MEM_BAR_CFG_W1; /**< Offset: 0x378 (R/W  16) EMI 1 Memory BAR Configuration Register (Word 1) ) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W2_bits_t EMI_1_MEM_BAR_CFG_W2; /**< Offset: 0x37A (R/W  16) EMI 1 Memory BAR Configuration Register (Word 2) ) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W3_bits_t EMI_1_MEM_BAR_CFG_W3; /**< Offset: 0x37C (R/W  16) EMI 1 Memory BAR Configuration Register (Word 3) ) */
  __IO  __ESPI_MEMORY_EMI_1_MEM_BAR_CFG_W4_bits_t EMI_1_MEM_BAR_CFG_W4; /**< Offset: 0x37E (R/W  16) EMI 1 Memory BAR Configuration Register (Word 4) ) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W0_bits_t SRAM_0_MEM_BAR_CFG_W0; /**< Offset: 0x3AC (R/W  16) SRAM BAR 0 Configuration Register (Word 0) ) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W1_bits_t SRAM_0_MEM_BAR_CFG_W1; /**< Offset: 0x3AE (R/W  16) SRAM BAR 0 Configuration Register (Word 1) ) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W2_bits_t SRAM_0_MEM_BAR_CFG_W2; /**< Offset: 0x3B0 (R/W  16) SRAM BAR 0 Configuration Register (Word 2) ) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W3_bits_t SRAM_0_MEM_BAR_CFG_W3; /**< Offset: 0x3B2 (R/W  16) SRAM BAR 0 Configuration Register (Word 3) ) */
  __IO  __ESPI_MEMORY_SRAM_0_MEM_BAR_CFG_W4_bits_t SRAM_0_MEM_BAR_CFG_W4; /**< Offset: 0x3B4 (R/W  16) SRAM BAR 0 Configuration Register (Word 4) ) */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W0_bits_t SRAM_1_MEM_BAR_CFG_W0; /**< Offset: 0x3B6 (R/W  16) SRAM BAR 1 Configuration Register (Word 0) ) */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W1_bits_t SRAM_1_MEM_BAR_CFG_W1; /**< Offset: 0x3B8 (R/W  16) SRAM BAR 1 Configuration Register (Word 1) ) */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W2_bits_t SRAM_1_MEM_BAR_CFG_W2; /**< Offset: 0x3BA (R/W  16) SRAM BAR 1 Configuration Register (Word 2) ) */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W3_bits_t SRAM_1_MEM_BAR_CFG_W3; /**< Offset: 0x3BC (R/W  16) SRAM BAR 1 Configuration Register (Word 3) ) */
  __IO  __ESPI_MEMORY_SRAM_1_MEM_BAR_CFG_W4_bits_t SRAM_1_MEM_BAR_CFG_W4; /**< Offset: 0x3BE (R/W  16) SRAM BAR 1 Configuration Register (Word 4) ) */
} espimemory_registers_t;
/** @}  end of The eSPI Memory Component is one of two Logical Devices (along with the I/O Component) that provide access to all the\n    registers in the device. */

#endif /* _PIC32CX_0525SG12_ESPI_MEMORY_COMPONENT_H_ */
